bhanuprakashjh/ProjectGaruda/dspic33AKESC/hal/hal_pwm.c
/**
 * @file hal_pwm.c
 *
 * @brief PWM module configuration for 6-step BLDC commutation.
 * Adapted from AN1292 reference:
 *   - Keeps: PCLKCON, MPER, dead time, complementary mode, PG1 master,
 *            PG2+PG3 slave, bootstrap charging, ADC trigger on PG1TRIGA
 *   - Changes: 24kHz switching frequency, override control for 6-step
 *   - Removes: Single-shunt trigger logic, SVM configuration
 *
 * Definitions in this file are for dsPIC33AK128MC106
 *
 * Component: PWM
 */

#include <xc.h>
#include <stdint.h>

#include "hal_pwm.h"
#include "../garuda_types.h"
#include "../garuda_config.h"

/* External commutation table defined in commutation.c */
extern const COMMUTATION_STEP_T commutationTable[6];

/**
 * @brief Initialize all PWM generators for 6-step BLDC control.
 */
void InitPWMGenerators(void)
{
    PCLKCON      = 0x0000;
    /* PWM Clock Divider: 1:2 */
    PCLKCONbits.DIVSEL = 0;
    /* PWM Master Clock: FPLLO (VCO/2 path) */
    PCLKCONbits.MCLKSEL = 1;
    /* Unlock write-protected registers */
    PCLKCONbits.LOCK = 0;

    /* Initialize Master Phase Register */
    MPHASE       = 0x0000;
    /* Initialize Master Duty Cycle */
    MDC          = 0x0000;
    /* Initialize Master Period Register */
    MPER         = LOOPTIME_TCY;

    /* Initialize FREQUENCY SCALE REGISTER */
    FSCL         = 0x0000;
    FSMINPER     = 0x0000;
    LFSR         = 0x0000;
    CMBTRIG      = 0x0000;
    LOGCONA      = 0x0000;
    LOGCONB      = 0x0000;
    LOGCONC      = 0x0000;
    LOGCOND      = 0x0000;
    LOGCONE      = 0x0000;
    LOGCONF      = 0x0000;
    PWMEVTA      = 0x0000;
    PWMEVTB      = 0x0000;
    PWMEVTC      = 0x0000;
    PWMEVTD      = 0x0000;
    PWMEVTE      = 0x0000;
    PWMEVTF      = 0x0000;

    /* Initialize individual PWM generators */
    InitPWMGenerator1();
    InitPWMGenerator2();
    InitPWMGenerator3();

    /* Start with all outputs overridden LOW */
    InitDutyPWM123Generators();

    /* Clearing and disabling PWM Interrupt */
    _PWM1IF = 0;
    _PWM1IE = 0;
    _PWM1IP = 7;

    /* Enable PWM modules: slaves first, then master */
    PG2CONbits.ON = 1;
    PG3CONbits.ON = 1;
    PG1CONbits.ON = 1;

    /* Charge bootstrap capacitors */
    ChargeBootstrapCapacitors();

    /* Re-assert overrides after bootstrap charging — keep all outputs LOW.
     * Bootstrap leaves overrides released (fine for FOC reference), but our
     * 6-step commutation needs override control: outputs must stay LOW
     * until the state machine enters ESC_ALIGN. */
    InitDutyPWM123Generators();
}

/**
 * @brief Override all PWM outputs LOW at startup.
 */
void InitDutyPWM123Generators(void)
{
    /* Set Override Data to 0 (LOW) on all outputs */
    PG3IOCONbits.OVRDAT = 0;
    PG2IOCONbits.OVRDAT = 0;
    PG1IOCONbits.OVRDAT = 0;

    /* Enable override on all H and L outputs */
    PG3IOCONbits.OVRENH = 1;
    PG3IOCONbits.OVRENL = 1;
    PG2IOCONbits.OVRENH = 1;
    PG2IOCONbits.OVRENL = 1;
    PG1IOCONbits.OVRENH = 1;
    PG1IOCONbits.OVRENL = 1;

    /* Set all duty cycles to zero */
    PG3DC = 0;
    PG2DC = 0;
    PG1DC = 0;
}

/**
 * @brief Charge bootstrap capacitors by pulsing low-side switches.
 */
void ChargeBootstrapCapacitors(void)
{
    uint32_t i = BOOTSTRAP_CHARGING_COUNTS;
    uint8_t prevStatusCAHALF = 0, currStatusCAHALF = 0;

    /* Override H-side LOW, let L-side run from PWM generator */
    PG3IOCONbits.OVRDAT = 0;
    PG2IOCONbits.OVRDAT = 0;
    PG1IOCONbits.OVRDAT = 0;

    PG3IOCONbits.OVRENH = 1;
    PG2IOCONbits.OVRENH = 1;
    PG1IOCONbits.OVRENH = 1;

    PG3IOCONbits.OVRENL = 1;
    PG2IOCONbits.OVRENL = 1;
    PG1IOCONbits.OVRENL = 1;

    /* Set tickle charge duty */
    PWM_PHASE3 = TICKLE_CHARGE_DUTY;
    PWM_PHASE2 = TICKLE_CHARGE_DUTY;
    PWM_PHASE1 = TICKLE_CHARGE_DUTY;
    PWM_PDC3 = TICKLE_CHARGE_DUTY;
    PWM_PDC2 = TICKLE_CHARGE_DUTY;
    PWM_PDC1 = TICKLE_CHARGE_DUTY;

    /* Release L-side override to allow charging */
    PG1IOCONbits.OVRENL = 0;
    PG2IOCONbits.OVRENL = 0;
    PG3IOCONbits.OVRENL = 0;

    /* Wait for bootstrap charging time */
    while (i)
    {
        prevStatusCAHALF = currStatusCAHALF;
        currStatusCAHALF = PG1STATbits.CAHALF;
        if (prevStatusCAHALF != currStatusCAHALF)
        {
            if (currStatusCAHALF == 0)
            {
                i--;
            }
        }
    }

    /* Reset duty cycles */
    PWM_PHASE3 = 0;
    PWM_PHASE2 = 0;
    PWM_PHASE1 = 0;
    PWM_PDC3 = 0;
    PWM_PDC2 = 0;
    PWM_PDC1 = 0;

    /* Release H-side override */
    PG3IOCONbits.OVRENH = 0;
    PG2IOCONbits.OVRENH = 0;
    PG1IOCONbits.OVRENH = 0;
}

/**
 * @brief Configure PWM Generator 1 (Phase A) — Master.
 */
void InitPWMGenerator1(void)
{
    PG1CON      = 0x0000;
    PG1CONbits.ON = 0;
    PG1CONbits.CLKSEL = 1;         /* Master clock */
    PG1CONbits.MODSEL = 4;         /* Center-Aligned PWM */
    PG1CONbits.TRGCNT = 0;
    PG1CONbits.MDCSEL = 0;         /* Use PG1DC */
    PG1CONbits.MPERSEL = 1;        /* Use MPER */
    PG1CONbits.MPHSEL = 0;
    PG1CONbits.MSTEN = 1;          /* Master — broadcasts EOC */
    PG1CONbits.UPDMOD = 0;
    PG1CONbits.TRGMOD = 0;
    PG1CONbits.SOCS = 0;           /* Local EOC */

    PG1STAT     = 0x0000;
    PG1IOCON    = 0x0000;

    PG1IOCONbits.CLMOD = 0;
    PG1IOCONbits.SWAP = 0;
    PG1IOCONbits.OVRENH = 1;       /* Start with override enabled */
    PG1IOCONbits.OVRENL = 1;
    PG1IOCONbits.OVRDAT = 0;       /* Override data = LOW */
    PG1IOCONbits.OSYNC = 0;
    PG1IOCONbits.FLTDAT = 0;
    PG1IOCONbits.CLDAT = 0;
    PG1IOCONbits.FFDAT = 0;
    PG1IOCONbits.DBDAT = 0;

    PG1IOCONbits.CAPSRC = 0;
    PG1IOCONbits.DTCMPSEL = 0;
    PG1IOCONbits.PMOD = 0;         /* Complementary mode */
    PG1IOCONbits.PENH = 1;
    PG1IOCONbits.PENL = 1;
    PG1IOCONbits.POLH = 0;
    PG1IOCONbits.POLL = 0;

    /* Event register */
    PG1EVT      = 0x0000;
    PG1EVTbits.ADTR1PS = 0;
    PG1EVTbits.ADTR1EN3 = 0;
    PG1EVTbits.ADTR1EN2 = 0;
    PG1EVTbits.ADTR1EN1 = 1;       /* PG1TRIGA triggers ADC */
    PG1EVTbits.UPDTRG = 1;         /* DC write triggers UPDATE */
    PG1EVTbits.PGTRGSEL = 0;
#ifdef ENABLE_PWM_FAULT_PCI
    PG1EVTbits.FLTIEN = 1;         /* Fault interrupt enabled (6-step ISR) */
#endif
    PG1EVTbits.CLIEN = 0;
    PG1EVTbits.FFIEN = 0;
    PG1EVTbits.SIEN = 0;
    PG1EVTbits.IEVTSEL = 3;        /* Time base interrupts disabled */
    PG1EVTbits.ADTR2EN3 = 0;
    PG1EVTbits.ADTR2EN2 = 0;
    PG1EVTbits.ADTR2EN1 = 0;
    PG1EVTbits.ADTR1OFS = 0;

    /* Fault PCI — external overcurrent via PCI8 pin (RB11/RP28).
     *
     * LEB-gated acceptance: the FPCI input is only accepted when LEB is LOW
     * (AQSS=010, AQPS=1). During the LEB window after each PWM edge (see
     * PGxLEB below), the board's U25B analog comparator ringing / FET
     * switching transients are ignored. After LEB expires, FPCI is fully
     * active and latches (ACP=3) on any real overcurrent. This suppresses
     * the BOARD_PCI trips we see on 2810 @ 24V where commutation transients
     * peak above U25B's fixed HW threshold for ~1µs after each edge. */
#ifdef ENABLE_PWM_FAULT_PCI
    PG1FPCI     = 0x0000;
    PG1FPCIbits.TSYNCDIS = 0;
    PG1FPCIbits.TERM = 1;           /* Auto-terminate when qualifier goes false */
    PG1FPCIbits.AQPS = 1;           /* Inverted: accept when LEB LOW (post-blanking) */
    PG1FPCIbits.AQSS = 0b010;       /* LEB active as acceptance qualifier */
    PG1FPCIbits.PSYNC = 0;
    PG1FPCIbits.PPS = 1;            /* Inverted polarity */
    PG1FPCIbits.PSS = 0b01000;      /* RPn input (PCI8R = board U25B) */
    PG1FPCIbits.BPEN = 0;
    PG1FPCIbits.BPSEL = 0;
    PG1FPCIbits.TERMPS = 0;
    PG1FPCIbits.ACP = 3;            /* Latched */
    PG1FPCIbits.LATMOD = 0;
    PG1FPCIbits.TQPS = 0;
    PG1FPCIbits.TQSS = 0;
#if FEATURE_HW_OVERCURRENT && OC_PROTECT_MODE == 1
    PG1FPCIbits.PSS = 0b11101;      /* CMP3 (replaces RPn/PCI8R) */
    PG1FPCIbits.PPS = 0;            /* Non-inverted */
#endif
#else
    /* FOC mode: FPCI truly disabled via acceptance qualifier gating.
     * Board U25B shunt comparator has no LEB — SVM switching transients
     * false-trip U25B → board fault latches → FPCI kills outputs.
     * Fix: ACP=1 (edge-sensitive, requires qualifier), AQSS=010 (LEB as
     * qualifier), AQPS=0. Since PGxLEB=0 in FOC, LEB never asserts →
     * qualifier never met → fault NEVER accepted. Software OC via ADC
     * ibusRaw is the primary protection in FOC mode. */
    PG1FPCI     = 0x0000;
    PG1FPCIbits.ACP  = 1;       /* Edge-sensitive (requires qualifier) */
    PG1FPCIbits.AQSS = 0b010;   /* LEB active as acceptance qualifier */
    PG1FPCIbits.AQPS = 0;       /* Non-inverted: need LEB HIGH to accept */
    PG1FPCIbits.TERM = 1;       /* Safety: auto-terminate if somehow accepted */
#endif

#if FEATURE_HW_OVERCURRENT && (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    PG1CLPCI    = 0x0000;
    PG1CLPCIbits.PSS = 0b11101;    /* Comparator 3 output */
    PG1CLPCIbits.PPS = 0;          /* Non-inverted (CMP3 high = overcurrent) */
    PG1CLPCIbits.TERM = 1;         /* Auto-terminate when PCI source goes inactive */
    PG1CLPCIbits.ACP = 0b011;     /* Latched acceptance (recommended with LEB) */
    PG1CLPCIbits.PSYNC = 0;
    PG1CLPCIbits.AQSS = 0b010;    /* LEB active as acceptance qualifier */
    PG1CLPCIbits.AQPS = 1;        /* Inverted: accept only when LEB inactive */
    /* CLIEN stays 0 — no ISR. CLPCI protection is pure hardware.
     * Trip counting uses CLEVT polling in ADC ISR. */
#else
    PG1CLPCI    = 0x0000;
#endif
    PG1FFPCI    = 0x0000;
    PG1SPCI     = 0x0000;
    /* LEB counter — drives the FPCI qualifier above (and CLPCI if enabled).
     * Runs on every H/L edge, so any CMP3 / board-U25B transient in the
     * first OC_LEB_COUNTS PWM clocks after a switch edge is ignored. */
#if FEATURE_HW_OVERCURRENT
    PG1LEB      = 0x0000;
    PG1LEBbits.PHR = 1;           /* Blank on rising edge of PWMxH */
    PG1LEBbits.PHF = 1;           /* Blank on falling edge of PWMxH */
    PG1LEBbits.PLR = 1;           /* Blank on rising edge of PWMxL */
    PG1LEBbits.PLF = 1;           /* Blank on falling edge of PWMxL */
    PG1LEBbits.LEB = OC_LEB_COUNTS;
#else
    PG1LEB      = 0x0000;
#endif

