bhanuprakashjh/ProjectGaruda/dspic33AKESC/hal/hal_pwm.c
void HAL_PWM_SetCommutationStep(uint8_t step)
{
    const COMMUTATION_STEP_T *s = &commutationTable[step];

#if FEATURE_CL_DIFF_IDLE
    s_diffStep = step;
    if (g_pwmDiffLow)
    {
        /* LOW phase → complementary PWM (its PDC carries the MIN_DUTY base,
         * written by HAL_PWM_SetDutyCycle). Active/float roles unchanged. */
        PG1IOCON = pgIoconWord((s->phaseA == PHASE_LOW) ? PHASE_PWM_ACTIVE : s->phaseA);
        PG2IOCON = pgIoconWord((s->phaseB == PHASE_LOW) ? PHASE_PWM_ACTIVE : s->phaseB);
        PG3IOCON = pgIoconWord((s->phaseC == PHASE_LOW) ? PHASE_PWM_ACTIVE : s->phaseC);
        return;
    }
#endif
    PG1IOCON = pgIoconWord(s->phaseA);
    PG2IOCON = pgIoconWord(s->phaseB);
    PG3IOCON = pgIoconWord(s->phaseC);
}

/**
 * @brief Set the PWM duty cycle on all three generators.
 * Only the active (PWM-driven) phase will produce output;
 * the other phases are held by override registers.
 *
 * @param duty Duty cycle in PWM clock counts
 */
void HAL_PWM_SetDutyCycle(uint32_t duty)
{
#if FEATURE_CL_DIFF_IDLE
    if (g_pwmDiffLow)
    {
        /* duty = EFFECTIVE duty (may be < MIN_DUTY). Active phase carries
         * MIN_DUTY + duty + deadtime compensation, low phase the MIN_DUTY base.
         * DEADTIME COMPENSATION (bench 2026-06-10): the two driven phases carry
         * OPPOSITE currents (active sources, low sinks — fixed in 6-step), so
         * their deadtime voltage errors ADD against the differential instead of
         * cancelling: ~2×(DT/T)×Vbus ≈ 0.65V eaten — measured as the rotor
         * settling at ~700 eRPM (≈0.07V real) on a 0.53V command. Current
         * directions are known by construction → deterministic comp: +2×DT
         * (= MIN_DUTY) on the active phase restores effective ≈ duty. */
        uint32_t active = duty + 2u * MIN_DUTY;
        if (active > MAX_DUTY) active = MAX_DUTY;
        const COMMUTATION_STEP_T *s = &commutationTable[s_diffStep];
        uint32_t dA = (s->phaseA == PHASE_PWM_ACTIVE) ? active : MIN_DUTY;
        uint32_t dB = (s->phaseB == PHASE_PWM_ACTIVE) ? active : MIN_DUTY;
        uint32_t dC = (s->phaseC == PHASE_PWM_ACTIVE) ? active : MIN_DUTY;
        PWM_PDC3 = dC;   /* slaves first, master (PG1) last — broadcast */
        PWM_PDC2 = dB;
        PWM_PDC1 = dA;
        return;
    }
#endif
    if (duty < MIN_DUTY) duty = MIN_DUTY;
    if (duty > MAX_DUTY) duty = MAX_DUTY;

    /* Write slave generators first, then master.
     * PG1 (master, UPDTRG=1) triggers an update broadcast on DC write.
     * Writing PG2/PG3 first ensures their buffers are set before
     * the master broadcasts the update event. */
    PWM_PDC3 = duty;
    PWM_PDC2 = duty;
    PWM_PDC1 = duty;
}

#if (FEATURE_SINE_STARTUP || FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078 || FEATURE_IF_STARTUP)
/**
 * @brief Set independent duty cycles on all three PWM generators.
 * Used by sine startup and FOC SVM to drive 3-phase waveforms.
 * Each phase gets its own duty value. Clamps to MIN_DUTY..MAX_DUTY.
 * Write order: slaves (PG3, PG2) before master (PG1).
 */
void HAL_PWM_SetDutyCycle3Phase(uint32_t dutyA, uint32_t dutyB, uint32_t dutyC)
{
    if (dutyA < MIN_DUTY) dutyA = MIN_DUTY;
    if (dutyA > MAX_DUTY) dutyA = MAX_DUTY;
    if (dutyB < MIN_DUTY) dutyB = MIN_DUTY;
    if (dutyB > MAX_DUTY) dutyB = MAX_DUTY;
    if (dutyC < MIN_DUTY) dutyC = MIN_DUTY;
    if (dutyC > MAX_DUTY) dutyC = MAX_DUTY;

    PWM_PDC3 = dutyC;
    PWM_PDC2 = dutyB;
    PWM_PDC1 = dutyA;
}

/**
 * @brief Release all PWM override registers.
 * Sets OVRENH=0, OVRENL=0 on PG1, PG2, PG3, allowing all three
 * generators to drive complementary PWM from their own PGxDC values.
 */
void HAL_PWM_ReleaseAllOverrides(void)
{
    PG3IOCONbits.OVRENH = 0;
    PG3IOCONbits.OVRENL = 0;
    PG2IOCONbits.OVRENH = 0;
    PG2IOCONbits.OVRENL = 0;
    PG1IOCONbits.OVRENH = 0;
    PG1IOCONbits.OVRENL = 0;
}

void HAL_PWM_ReleaseFloatPhase(uint8_t step)
{
    switch (commutationTable[step].floatingPhase)
    {
        case 0: PG1IOCONbits.OVRENH = 0; PG1IOCONbits.OVRENL = 0; break;
        case 1: PG2IOCONbits.OVRENH = 0; PG2IOCONbits.OVRENL = 0; break;
        case 2: PG3IOCONbits.OVRENH = 0; PG3IOCONbits.OVRENL = 0; break;
    }
}

void HAL_PWM_FloatPhaseToHiZ(uint8_t step)
{
    switch (commutationTable[step].floatingPhase)
    {
        case 0:
            PG1IOCONbits.OVRDAT = 0b00;
            PG1IOCONbits.OVRENH = 1; PG1IOCONbits.OVRENL = 1; break;
        case 1:
            PG2IOCONbits.OVRDAT = 0b00;
            PG2IOCONbits.OVRENH = 1; PG2IOCONbits.OVRENL = 1; break;
        case 2:
            PG3IOCONbits.OVRDAT = 0b00;
            PG3IOCONbits.OVRENH = 1; PG3IOCONbits.OVRENL = 1; break;
    }
}
#endif /* FEATURE_SINE_STARTUP || FEATURE_FOC || FEATURE_FOC_V2 */

#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078 || FEATURE_IF_STARTUP
/**
 * @brief Set 3-phase PWM duty cycles from float [0.0, 1.0] values.
 * Converts normalised float duties to PWM register counts, clamps,
 * and writes in slave-before-master order.
 */
void HAL_PWM_SetDutyFloat3Phase(float da, float db, float dc)
{
    /* NaN/Inf safety: clamp inputs to [0,1] before float→uint32 conversion.
     * NaN bypasses normal comparisons (NaN < x and NaN > x both false),
     * so (uint32_t)(NaN * range) is undefined behavior — can cause a
     * CPU trap on dsPIC33AK FPU. Force to 0.5 (safe center duty). */
    if (!(da >= 0.0f && da <= 1.0f)) da = 0.5f;
    if (!(db >= 0.0f && db <= 1.0f)) db = 0.5f;
    if (!(dc >= 0.0f && dc <= 1.0f)) dc = 0.5f;

    /* Map [0,1] → [0, LOOPTIME_TCY] (full PWM range).
     * SVM already outputs centered duties — no MIN_DUTY offset needed.
     * Clamp to [MIN_DUTY, MAX_DUTY] for dead-time safety only. */
    uint32_t a = (uint32_t)(da * (float)LOOPTIME_TCY);
    uint32_t b = (uint32_t)(db * (float)LOOPTIME_TCY);
    uint32_t c = (uint32_t)(dc * (float)LOOPTIME_TCY);
    if (a < MIN_DUTY) a = MIN_DUTY;  if (a > MAX_DUTY) a = MAX_DUTY;
    if (b < MIN_DUTY) b = MIN_DUTY;  if (b > MAX_DUTY) b = MAX_DUTY;
    if (c < MIN_DUTY) c = MIN_DUTY;  if (c > MAX_DUTY) c = MAX_DUTY;
    PG3DC = c;  /* Slave C first */
    PG2DC = b;  /* Slave B */
    PG1DC = a;  /* Master A last (triggers broadcast) */
}
#endif /* FEATURE_FOC || FEATURE_FOC_V2 */
